DataProcessors/ПР_РМДоговора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ПР_РМДоговора</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Documents/ПР_ДоговорДолевогоУчастия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорДолевогоУчастия</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДПП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДПП</Name>
			<BasedOn>
				<xr:Item>Document.ПР_ДоговорДолевогоУчастия</xr:Item>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_ДоговорОтделки</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
				<xr:Item>Document.ПР_ДоговорОснащения</xr:Item>
				<xr:Item>Document.ПР_ДПП</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйКонтрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтарыйДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Причина</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПР_ПричинаПередачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_АППЗастройщик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_АППЗастройщик</Name>
			<BasedOn>
				<xr:Item>Document.ПР_ДоговорДолевогоУчастия</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПередачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДоговорОснащения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОснащения</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОснащения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПР_ТипыОснащения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОснащения</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПР_ДоговорОтделки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ПР_ДоговорОтделки</Name>
			<BasedOn>
				<xr:Item>Document.АР17_ЗаключениеАгентскогоДоговора</xr:Item>
				<xr:Item>Document.ПР_АППЗастройщик</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АгентскийДоговор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АР_ОбъектыАренды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДПП</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорДолевогоУчастия</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_АППЗастройщик</v8:Type>
						<v8:Type>cfg:DocumentRef.ПР_ДоговорОтделки</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ГрафикПогашения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПР_РМДоговора/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура НайтиНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК КАК ИК,
	               |	МАКСИМУМ(КОНЕЦПЕРИОДА(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи, ДЕНЬ)) КАК ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ЗАД
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент.Наименование ПОДОБНО &Наименование
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Наименование ПОДОБНО &Наименование
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.ПомещениеНомерБТИ ПОДОБНО &Наименование)
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_ДоговорДолевогоУчастия.Ссылка.Контрагент,
	               |	ПР_ДоговорДолевогоУчастия.Помещение,
	               |	NULL,
	               |	КОНЕЦПЕРИОДА(ПР_ДоговорДолевогоУчастия.ДатаНачала, ДЕНЬ),
	               |	ПР_ДоговорДолевогоУчастия.Ссылка
	               |ИЗ
	               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
	               |ГДЕ
	               |	ПР_ДоговорДолевогоУчастия.Ссылка.Проведен
	               |	И (ПР_ДоговорДолевогоУчастия.Ссылка.Контрагент.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_ДоговорДолевогоУчастия.Помещение.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_ДоговорДолевогоУчастия.Помещение.ПомещениеНомерБТИ ПОДОБНО &Наименование)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ДоговорДолевогоУчастия.Ссылка.Контрагент,
	               |	ПР_ДоговорДолевогоУчастия.Помещение,
	               |	ПР_ДоговорДолевогоУчастия.Ссылка,
	               |	КОНЕЦПЕРИОДА(ПР_ДоговорДолевогоУчастия.ДатаНачала, ДЕНЬ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_ДПП.Ссылка.Контрагент,
	               |	ПР_ДПП.Помещение,
	               |	NULL,
	               |	КОНЕЦПЕРИОДА(ПР_ДПП.ДатаПередачи, ДЕНЬ),
	               |	ПР_ДПП.Ссылка
	               |ИЗ
	               |	Документ.ПР_ДПП КАК ПР_ДПП
	               |ГДЕ
	               |	ПР_ДПП.Ссылка.Проведен
	               |	И (ПР_ДПП.Ссылка.Контрагент.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_ДПП.Помещение.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_ДПП.Помещение.ПомещениеНомерБТИ ПОДОБНО &Наименование)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_ДПП.Ссылка.Контрагент,
	               |	ПР_ДПП.Помещение,
	               |	ПР_ДПП.Ссылка,
	               |	КОНЕЦПЕРИОДА(ПР_ДПП.ДатаПередачи, ДЕНЬ)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_АППЗастройщик.Ссылка.Контрагент,
	               |	ПР_АППЗастройщик.Помещение,
	               |	NULL,
	               |	КОНЕЦПЕРИОДА(ПР_АППЗастройщик.ДатаПередачи, ДЕНЬ),
	               |	ПР_АППЗастройщик.Ссылка
	               |ИЗ
	               |	Документ.ПР_АППЗастройщик КАК ПР_АППЗастройщик
	               |ГДЕ
	               |	ПР_АППЗастройщик.Ссылка.Проведен
	               |	И (ПР_АППЗастройщик.Ссылка.Контрагент.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_АППЗастройщик.Помещение.Наименование ПОДОБНО &Наименование
	               |			ИЛИ ПР_АППЗастройщик.Помещение.ПомещениеНомерБТИ ПОДОБНО &Наименование)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПР_АППЗастройщик.Ссылка.Контрагент,
	               |	ПР_АППЗастройщик.Помещение,
	               |	ПР_АППЗастройщик.Ссылка,
	               |	КОНЕЦПЕРИОДА(ПР_АППЗастройщик.ДатаПередачи, ДЕНЬ)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент КАК Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды КАК ОбъектАренды,
	               |	МАКСИМУМ(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи) КАК ДатаПередачи
	               |ПОМЕСТИТЬ ЗАД1
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент.Наименование ПОДОБНО &Наименование
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.Наименование ПОДОБНО &Наименование
	               |			ИЛИ АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды.ПомещениеНомерБТИ ПОДОБНО &Наименование)
	               |	И АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Проведен
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗАД.ОбъектАренды КАК ОбъектАренды,
	               |	МАКСИМУМ(ЗАД.ДатаПередачи) КАК ДатаПередачи
	               |ПОМЕСТИТЬ ЗАДДата
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ЗАД.ОбъектАренды
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЗАД.Контрагент КАК Контрагент,
	               |	ЗАД.ОбъектАренды КАК ОбъектАренды,
	               |	ЗАД.ДатаПередачи КАК ДатаПередачи,
	               |	ЗАД.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ЗАДКонтрагент
	               |ИЗ
	               |	ЗАД КАК ЗАД
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗАДДата КАК ЗАДДата
	               |		ПО ЗАД.ОбъектАренды = ЗАДДата.ОбъектАренды
	               |			И ЗАД.ДатаПередачи = ЗАДДата.ДатаПередачи
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЗАДКонтрагент.Контрагент КАК Контрагент,
	               |	ЕСТЬNULL(ЗАДКонтрагент.ОбъектАренды, АР_ОбъектыАренды.Ссылка) КАК ОбъектАренды,
	               |	ЕСТЬNULL(АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.ИК, АР_ОбъектыАренды.Родитель.Родитель.Родитель) КАК ИК,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка КАК Ссылка
	               |ИЗ
	               |	ЗАДКонтрагент КАК ЗАДКонтрагент
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Справочник.АР_ОбъектыАренды КАК АР_ОбъектыАренды
	               |		ПО ЗАДКонтрагент.ОбъектАренды = АР_ОбъектыАренды.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ЗАД1 КАК ЗАД1
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |			ПО ЗАД1.Контрагент = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент
	               |				И ЗАД1.ОбъектАренды = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды
	               |				И ЗАД1.ДатаПередачи = АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи
	               |		ПО ЗАДКонтрагент.Контрагент = ЗАД1.Контрагент
	               |			И ЗАДКонтрагент.ОбъектАренды = ЗАД1.ОбъектАренды
	               |ГДЕ
	               |	(АР_ОбъектыАренды.Ссылка.Наименование ПОДОБНО &Наименование
	               |			ИЛИ АР_ОбъектыАренды.Ссылка.ПомещениеНомерБТИ ПОДОБНО &Наименование
	               |			ИЛИ ЗАДКонтрагент.Контрагент.Наименование ПОДОБНО &Наименование)
	               |	И АР_ОбъектыАренды.ТипОбъекта = &ТипОбъекта";
	Запрос.УстановитьПараметр("Наименование","%" + СтрокаПоиска + "%"); 
	Запрос.УстановитьПараметр("ТипОбъекта",Справочники.АР_ТипыОбъектовАренды.Офис);
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого стр Из Рез Цикл
		СтрО = РезультатОтбора.Добавить(); 
		СтрО.ОбъектАренды = стр.ОбъектАренды;
		СтрО.Наименование = СокрЛП(стр.ОбъектАренды.Наименование) + " / ПИБ " + СокрЛП(стр.ОбъектАренды.ПомещениеНомерБТИ) + " / " + СокрЛП(стр.ИК.Наименование);
		СтрО.Собственник = стр.Контрагент;
		СтрО.ЗАД = стр.Ссылка;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура _Найти(Команда) 
	Если СокрЛП(СтрокаПоиска) = "" Тогда
		Сообщить("Не заданы параметры поиска!" );
		Возврат;
	КонецЕсли;   
	РезультатОтбора.Очистить();
	НайтиНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Гоу()
	РезультатОтбора.Очистить();
	НайтиНаСервере();
КонецПроцедуры	

&НаКлиенте
Процедура РезультатОтбораПриАктивизацииСтроки(Элемент)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ТекСтрока = Элемент.ТекущиеДанные; 
	Помещение = ТекСтрока.ОбъектАренды;
	Собственники = ТекСтрока.Собственник;
	ДоходнаяПрограмма =  ПолучитьПрограммуДоходности(ТекСтрока.ЗАД); 
	ПУД = ПолучитьПУД(ТекСтрока.Собственник,ТекСтрока.ОбъектАренды,ТекСтрока.ЗАД);
	Оснащение = ПолучитьОснащение(ТекСтрока.ЗАД);
	ЗаполнитьПодробно(ТекСтрока.ОбъектАренды);  
	КомплектПриИзменении(Элемент);
КонецПроцедуры  

Функция ПолучитьПУД(Собственник,ОбъектАренды,ЗАД)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(ПР_АППЗастройщик.Ссылка, НЕОПРЕДЕЛЕНО) КАК АПП
	               |ПОМЕСТИТЬ АППТ
	               |ИЗ
	               |	Документ.ПР_АППЗастройщик КАК ПР_АППЗастройщик
	               |ГДЕ
	               |	ПР_АППЗастройщик.Проведен
	               |	И ПР_АППЗастройщик.Помещение = &Помещение
	               |	И ПР_АППЗастройщик.Контрагент = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ПР_ДоговорДолевогоУчастия.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДДУ
	               |ПОМЕСТИТЬ ДДУТ
	               |ИЗ
	               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
	               |ГДЕ
	               |	ПР_ДоговорДолевогоУчастия.Проведен
	               |	И ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
	               |	И ПР_ДоговорДолевогоУчастия.Контрагент = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ПР_ДПП.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДПП
	               |ПОМЕСТИТЬ ДППТ
	               |ИЗ
	               |	Документ.ПР_ДПП КАК ПР_ДПП
	               |ГДЕ
	               |	ПР_ДПП.Проведен
	               |	И ПР_ДПП.Помещение = &Помещение
	               |	И ПР_ДПП.Контрагент = &Контрагент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(АППТ.АПП, НЕОПРЕДЕЛЕНО) КАК АПП,
	               |	ЕСТЬNULL(ДДУТ.ДДУ, НЕОПРЕДЕЛЕНО) КАК ДДУ,
	               |	ЕСТЬNULL(ДППТ.ДПП, НЕОПРЕДЕЛЕНО) КАК ДПП
	               |ИЗ
	               |	АППТ КАК АППТ
	               |		ПОЛНОЕ СОЕДИНЕНИЕ ДДУТ КАК ДДУТ
	               |			ПОЛНОЕ СОЕДИНЕНИЕ ДППТ КАК ДППТ
	               |			ПО (ИСТИНА)
	               |		ПО (ИСТИНА)";
	Запрос.УстановитьПараметр("Помещение",ОбъектАренды);
	Запрос.УстановитьПараметр("Контрагент",Собственник);
	Рез = Запрос.Выполнить().Выгрузить();
	Если Рез.Количество() = 0 Тогда
		Возврат ЗАД;
	ИначеЕсли НЕ Рез[0].ДПП = неопределено Тогда
		Возврат Рез[0].ДПП;
	ИначеЕсли НЕ Рез[0].АПП = неопределено Тогда
		Возврат Рез[0].АПП;
	ИначеЕсли НЕ Рез[0].ДДУ = неопределено Тогда
		Возврат Рез[0].ДДУ;
	Иначе 
		Возврат ЗАД;
	КонецЕсли;
КонецФункции

Функция ПолучитьПрограммуДоходности(ЗАД)
	Если ТипЗнч(ЗАД) = ТИП("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") Тогда
		Возврат Строка(ЗАД.ПрограммаДоходности) + " Действует с " + Формат(ЗАД.ОбъектыАренды[0].ДатаПередачи,"ДФ=""дд ММММ гггг 'г.'""") 
					+ ?(ЗначениеЗаполнено(ЗАД.ОбъектыАренды[0].ДатаВозврата), " по " + Формат(ЗАД.ОбъектыАренды[0].ДатаВозврата,"ДФ=""дд ММММ гггг 'г.'"""),"") ;
	КонецЕсли
КонецФункции 

Функция ПолучитьОснащение(ЗАД)  
	Если ТипЗнч(ЗАД) = ТИП("ДокументСсылка.АР17_ЗаключениеАгентскогоДоговора") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	МАКСИМУМ(ПР_ДоговорОснащения.Дата) КАК Дата
		               |ПОМЕСТИТЬ ПоследнийДоговор
		               |ИЗ
		               |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
		               |ГДЕ
		               |	ПР_ДоговорОснащения.АгентскийДоговор = &АгентскийДоговор
		               |	И ПР_ДоговорОснащения.Проведен
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ПР_ДоговорОснащения.Сумма КАК Сумма,
		               |	ПР_ДоговорОснащения.ТипОснащения КАК ТипОснащения,
		               |	ПР_ДоговорОснащения.ДатаОкончания КАК ДатаОкончания
		               |ИЗ
		               |	ПоследнийДоговор КАК ПоследнийДоговор
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
		               |		ПО ПоследнийДоговор.Дата = ПР_ДоговорОснащения.Дата
		               |ГДЕ
		               |	ПР_ДоговорОснащения.АгентскийДоговор = &АгентскийДоговор
		               |	И ПР_ДоговорОснащения.Проведен";
		Запрос.УстановитьПараметр("АгентскийДоговор",ЗАД);
		Рез = Запрос.Выполнить().Выгрузить();
		Если Рез.Количество() > 0 Тогда
			Возврат Строка(Рез[0].Сумма) + " " + Строка(Рез[0].ТипОснащения) + ?((Рез[0].ДатаОкончания = Дата(1,1,1)),"", " до " + Формат(Рез[0].ДатаОкончания,"ДФ=""дд ММММ гггг 'г.'"""));
		КонецЕсли; 
	КонецЕсли;
	Возврат 0;
КонецФункции         

Процедура ЗаполнитьПодробно(ОбъектАренды)    
	Подробно.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПР_ДоговорОснащения.Ссылка КАК Ссылка,
	               |	ПР_ДоговорОснащения.Дата КАК Дата,
	               |	ПР_ДоговорОснащения.Номер КАК Номер,
	               |	ПР_ДоговорОснащения.Помещение КАК Помещение,
	               |	ПР_ДоговорОснащения.ДатаНачала КАК ДатаНачала,
	               |	ПР_ДоговорОснащения.Контрагент КАК Контрагент
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	Документ.ПР_ДоговорОснащения КАК ПР_ДоговорОснащения
	               |ГДЕ
	               |	ПР_ДоговорОснащения.Помещение = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_ДоговорДолевогоУчастия.Ссылка,
	               |	ПР_ДоговорДолевогоУчастия.Дата,
	               |	ПР_ДоговорДолевогоУчастия.Номер,
	               |	ПР_ДоговорДолевогоУчастия.Помещение,
	               |	ПР_ДоговорДолевогоУчастия.ДатаНачала,
	               |	ПР_ДоговорДолевогоУчастия.Контрагент
	               |ИЗ
	               |	Документ.ПР_ДоговорДолевогоУчастия КАК ПР_ДоговорДолевогоУчастия
	               |ГДЕ
	               |	ПР_ДоговорДолевогоУчастия.Помещение = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_АППЗастройщик.Ссылка,
	               |	ПР_АППЗастройщик.Дата,
	               |	ПР_АППЗастройщик.Номер,
	               |	ПР_АППЗастройщик.Помещение,
	               |	ПР_АППЗастройщик.ДатаПередачи,
	               |	ПР_АППЗастройщик.Контрагент
	               |ИЗ
	               |	Документ.ПР_АППЗастройщик КАК ПР_АППЗастройщик
	               |ГДЕ
	               |	ПР_АППЗастройщик.Помещение = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Дата,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Номер,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ДатаПередачи,
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.Ссылка.Контрагент
	               |ИЗ
	               |	Документ.АР17_ЗаключениеАгентскогоДоговора.ОбъектыАренды КАК АР17_ЗаключениеАгентскогоДоговораОбъектыАренды
	               |ГДЕ
	               |	АР17_ЗаключениеАгентскогоДоговораОбъектыАренды.ОбъектАренды = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	КВП_ОткрытиеЛицевогоСчета.Ссылка,
	               |	КВП_ОткрытиеЛицевогоСчета.Ссылка.Дата,
	               |	КВП_ОткрытиеЛицевогоСчета.Ссылка.Номер,
	               |	КВП_ОткрытиеЛицевогоСчета.ЛицевойСчет.Адрес,
	               |	КВП_ОткрытиеЛицевогоСчета.Дата,
	               |	КВП_ОткрытиеЛицевогоСчета.Ссылка.Контрагент
	               |ИЗ
	               |	Документ.КВП_ОткрытиеЛицевогоСчета КАК КВП_ОткрытиеЛицевогоСчета
	               |ГДЕ
	               |	(ВЫРАЗИТЬ(КВП_ОткрытиеЛицевогоСчета.ЛицевойСчет.Адрес.Наименование КАК СТРОКА(5))) = (ВЫРАЗИТЬ(&ПомещениеНаименование КАК СТРОКА(5)))
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_ДПП.Ссылка,
	               |	ПР_ДПП.Ссылка.Дата,
	               |	ПР_ДПП.Ссылка.Номер,
	               |	ПР_ДПП.Помещение,
	               |	ПР_ДПП.ДатаПередачи,
	               |	ПР_ДПП.Ссылка.Контрагент
	               |ИЗ
	               |	Документ.ПР_ДПП КАК ПР_ДПП
	               |ГДЕ
	               |	ПР_ДПП.Помещение = &Помещение
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ПР_ДоговорОтделки.Ссылка,
	               |	ПР_ДоговорОтделки.Дата,
	               |	ПР_ДоговорОтделки.Номер,
	               |	ПР_ДоговорОтделки.Помещение,
	               |	ПР_ДоговорОтделки.ДатаНачала,
	               |	ПР_ДоговорОтделки.Контрагент
	               |ИЗ
	               |	Документ.ПР_ДоговорОтделки КАК ПР_ДоговорОтделки
	               |ГДЕ
	               |	ПР_ДоговорОтделки.Помещение = &Помещение
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.Ссылка КАК Ссылка,
	               |	ВТ.Дата КАК Дата,
	               |	ВТ.Номер КАК Номер,
	               |	ВТ.Помещение КАК Помещение,
	               |	ВТ.ДатаНачала КАК ДатаНачала,
	               |	ВТ.Контрагент КАК Контрагент,
	               |	ВЫБОР
	               |		КОГДА ВТ.Ссылка.Проведен
	               |			ТОГДА 2
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ.Ссылка.ПометкаУдаления
	               |					ТОГДА 3
	               |				ИНАЧЕ 0
	               |			КОНЕЦ
	               |	КОНЕЦ КАК СостояниеДокумента
	               |ИЗ
	               |	ВТ КАК ВТ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Дата";
	Запрос.УстановитьПараметр("Помещение",ОбъектАренды);
	Запрос.УстановитьПараметр("ПомещениеНаименование",ОбъектАренды.Наименование);
	Рез = Запрос.Выполнить().Выгрузить();
	Для каждого стр Из Рез Цикл
		Док = Подробно.Добавить();
		Док.Дата = стр.Дата;
		Док.Ссылка = стр.Ссылка;
		Попытка
			Док.ПрограммаДоходности = стр.Ссылка.ПрограммаДоходности;  
		Исключение
		КонецПопытки;
		Док.НомерДоговора = стр.Номер;
		Док.ДатаДоговора = стр.ДатаНачала;
		Док.Контрагент = стр.Контрагент;
		Док.СостояниеДокумента = стр.СостояниеДокумента;
	КонецЦикла	
КонецПроцедуры

&НаСервере
Процедура КомплектПриИзмененииНаСервере()
	Компл = Комплект.ПолучитьОбъект();
	Для каждого стр Из Компл.Договора Цикл
		Док = ТабДокументы.Добавить();
		Док.ТипДокумента = стр.ТипДоговора;
		Док.Приоритет = стр.Приоритет;
		Док.Документ = НайтиДок(стр.ТипДоговора);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомплектПриИзменении(Элемент = Неопределено) 
	Если ЗначениеЗаполнено(Комплект) Тогда   
		ТабДокументы.Очистить(); 
		КомплектПриИзмененииНаСервере(); 
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьСостояние(Док)
	Если Док.Проведен Тогда
		Возврат 2;
	ИначеЕсли Док.ПометкаУдаления Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

Функция НайтиДок(ТипДоговора) 
	Для каждого стр Из Подробно Цикл
		Если стр.Контрагент = Собственники И ТипЗнч(стр.Ссылка) = ТипДоговора.ТипЗначения.Типы()[0] И стр.Ссылка.Проведен И НЕ ТипЗнч(стр.Ссылка) = Тип("ДокументСсылка.ПР_ДПП") Тогда  
			Возврат стр.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

Функция НайтиОснованиеДляЗАД()
	Для каждого стр Из ТабДокументы Цикл
		Если ТипЗнч(стр.Документ) = Тип("ДокументСсылка.ПР_АППЗастройщик") 
					ИЛИ ТипЗнч(стр.Документ) = Тип("ДокументСсылка.ПР_ДПП") Тогда
			Возврат стр.Документ;
		КонецЕсли;
	КонецЦикла;
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция СоздатьДоговораНаСервере(ТипД)
	Док = Документы[Метаданные.НайтиПоТипу(ТипД.ТипЗначения.Типы()[0]).Имя].СоздатьДокумент();
	Если ТипЗнч(Док) = Тип("ДокументОбъект.ПР_ДоговорДолевогоУчастия") Тогда
		Док.Дата = ТекущаяДата();
		Док.Помещение = Помещение;
		Док.Записать(РежимЗаписиДокумента.Запись); 
		Возврат Док.Ссылка;
	КонецЕсли;
	Если ТипЗнч(Док) = Тип("ДокументОбъект.АР17_ЗаключениеАгентскогоДоговора") Тогда 
		ДокОснование = НайтиОСнованиеДляЗАД();
		Если НЕ ДокОснование = Неопределено  Тогда  
			Док.Заполнить(ДокОснование);
			Док.Дата = ТекущаяДата();
			Док.Записать(РежимЗаписиДокумента.Запись); 
			Возврат Док.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Док) = Тип("ДокументОбъект.ПР_ДоговорОснащения") Тогда
		Док.Дата = ТекущаяДата();
		Док.Помещение = Помещение;
		//Док.Записать(РежимЗаписиДокумента.Запись); 
		//Возврат Док.Ссылка;
	КонецЕсли;
	ТабДокументы.Сортировать("Приоритет");
	Для каждого табдок Из ТабДокументы Цикл
		Если табдок.Документ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			Док.Заполнить(табдок.Документ); 
			Док.ДокументОСнование = табдок.Документ.Ссылка; 
		Исключение
		КонецПопытки;
		ДокК = Ложь;
		ДокО = Ложь;
		Попытка 
			ДокК = ЗначениеЗаполнено(Док.Контрагент);
		Исключение
		КонецПопытки;
		Попытка 
			ДокО = ЗначениеЗаполнено(Док.Организация);
		Исключение
		КонецПопытки;
		Если ДокК ИЛИ ДокО Тогда
			Док.Записать(РежимЗаписиДокумента.Запись); 
			Возврат Док.Ссылка;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(Док) = Тип("ДокументОбъект.АР17_ЗаключениеАгентскогоДоговора") Тогда
		Док.Дата = ТекущаяДата();
		Док.ИК = Помещение.Родитель.Родитель.Родитель;
		Док.Контрагент = Собственники;
		Стр = Док.ОбъектыАренды.Добавить();
		Стр.ОбъектАренды = Помещение;
		ЗаполнитьТЧ(Док,Стр.НомерСтроки,Стр.ОбъектАренды);
	КонецЕсли;	
	Док.Записать(РежимЗаписиДокумента.Запись); 
	Возврат Док.Ссылка;
КонецФункции

Процедура ЗаполнитьТЧ(Док,НомерСтроки,ОбъектАренды)
	
	Стр = Док.ОбъектыАренды[НомерСтроки-1];
	Если Стр.ОбъектАренды.МОП > 0 Тогда	
		Стр.ТипПомещения = "МОП";
	ИначеЕсли Стр.ОбъектАренды.АП > 0 Тогда
		Стр.ТипПомещения = "АП";
	ИначеЕсли Стр.ОбъектАренды.ТП > 0 Тогда
		Стр.ТипПомещения = "ТП";
	ИначеЕсли Стр.ОбъектАренды.ВП > 0 Тогда
		Стр.ТипПомещения = "ВП";
	КонецЕсли;
	// Расположение
	Стр.Расположение = СокрЛП(Стр.ОбъектАренды.Родитель.Родитель.Родитель) + ", " + СокрЛП(Стр.ОбъектАренды.Родитель.Родитель);
	Стр.Площадь = Стр.ОбъектАренды.ЗначениеХарактеристики;
	Стр.КлассПомещения = Стр.ОбъектАренды.КлассПомещения;
	
КонецПроцедуры	

&НаКлиенте
Процедура СоздатьДоговора(Команда)  
	//ТекДанные = Документы.те
	Для каждого стр из ТабДокументы Цикл
		Если стр.Создать и Не ЗначениеЗаполнено(стр.Документ) Тогда
			Док = СоздатьДоговораНаСервере(стр.ТипДокумента);  
			стр.Документ = Док;
			ПоказатьЗначение(,Док);
		КонецЕсли;
	КонецЦикла; 
	ЗаполнитьПодробно(Помещение);
	КомплектПриИзменении(Команда);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Элементы.Найти.СочетаниеКлавиш = БыстрыйВызов(13);
КонецПроцедуры

Функция БыстрыйВызов(Код, Alt=0, Control=0, Shift=0) Экспорт
    Возврат ЗначениеИзСтрокиВнутр("{""#"",69cf4251-8759-11d5-bf7e-0050bae2bc79,1,
        |{0,"+ Формат(Код, "ЧН=0; ЧГ=0") +","+ Формат(Alt*16+Control*8+Shift*4, "ЧН=0; ЧГ=0") +"}
        |}");
КонецФункции

&НаКлиенте
Процедура СтрокаПоискаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	ПодключитьОбработчикОжидания("Гоу", 0.1, Истина);
КонецПроцедуры
